karyna-volokhatiuk/MandMs-sorting/after_cleaning_need_fix/MandMs-sorting.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Clock.h"
#include "Step_1.h"
#include "Step_1_aliases.h"
#include "Control_Reg_1.h"
#include "Step_2_5.h"
#include "Step_2_5_aliases.h"
#include "Step_3_4.h"
#include "Step_3_4_aliases.h"
#include "Dir_1.h"
#include "Dir_1_aliases.h"
#include "Dir_2_5.h"
#include "Dir_2_5_aliases.h"
#include "Dir_3_4.h"
#include "Dir_3_4_aliases.h"
#include "Control_Reg_2.h"
#include "Status_Reg_1.h"
#include "PWM_Container.h"
#include "Dir_Container.h"
#include "Dir_Container_aliases.h"
#include "Step_Container.h"
#include "Step_Container_aliases.h"
#include "I2C.h"
#include "I2C_I2C.h"
#include "I2C_PINS.h"
#include "I2C_I2C_PVT.h"
#include "I2C_PVT.h"
#include "I2C_BOOT.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "PWM_RED.h"
#include "PWM_GREEN.h"
#include "PWM_BLUE.h"
#include "RED.h"
#include "RED_aliases.h"
#include "GREEN.h"
#include "GREEN_aliases.h"
#include "BLUE.h"
#include "BLUE_aliases.h"
#include "SW.h"
#include "SW_aliases.h"
#include "isr_SW.h"
#include "SW_UpDown.h"
#include "SW_UpDown_aliases.h"
#include "ADC.h"
#include "isr_SW_UpDown.h"
#include "I2C_SCBCLK.h"
#include "I2C_sda.h"
#include "I2C_sda_aliases.h"
#include "I2C_scl.h"
#include "I2C_scl_aliases.h"
#include "I2C_SCB_IRQ.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

